In [1]:
# 练习重复值处理
import pandas as pd
import numpy as np

In [2]:
num_obj = pd.DataFrame({'data1' : ['a'] * 5 + ['b'] * 5,
                        'data2' : np.random.randint(0,5,10)})# 生成重复值随机数
print(num_obj)

  data1  data2
0     a      3
1     a      0
2     a      3
3     a      2
4     a      4
5     b      2
6     b      4
7     b      0
8     b      4
9     b      1

In [3]:
print(num_obj.duplicated())# 找出重复值

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8     True
9    False
dtype: bool

In [4]:
num_obj[~num_obj.duplicated()]# 取出不重复值

  data1  data2
0     a      3
1     a      0
3     a      2
4     a      4
5     b      2
6     b      4
7     b      0
9     b      1

In [5]:
print(num_obj.duplicated(('data2')))

0    False
1    False
2     True
3    False
4    False
5     True
6     True
7     True
8     True
9    False
dtype: bool

In [6]:
num_obj1 = pd.DataFrame({'data1' : [np.nan] * 5,
                         'data2' : list('12346')})# 生成重复值随机数
num_obj1

   data1 data2
0    NaN     1
1    NaN     2
2    NaN     3
3    NaN     4
4    NaN     6

In [7]:
num_obj1.duplicated('data1')# 找出重复值

0    False
1     True
2     True
3     True
4     True
dtype: bool

In [8]:
print(num_obj1.drop_duplicates())# 删除重复值

   data1 data2
0    NaN     1
1    NaN     2
2    NaN     3
3    NaN     4
4    NaN     6

In [9]:
num_obj

  data1  data2
0     a      3
1     a      0
2     a      3
3     a      2
4     a      4
5     b      2
6     b      4
7     b      0
8     b      4
9     b      1

In [10]:
ser_obj = pd.Series(np.random.randint(0,100,100))# 生成随机数
print(ser_obj)
print(ser_obj.map(lambda x : x ** 2))# 映射平方

0     75
1     10
2     23
3      1
4     60
      ..
95    79
96    93
97     1
98    11
99    70
Length: 100, dtype: int32
0     5625
1      100
2      529
3        1
4     3600
      ...
95    6241
96    8649
97       1
98     121
99    4900
Length: 100, dtype: int64

In [11]:
ser_obj=pd.Series(np.arange(10),index=range(5,15))#异常值手动替换
print(ser_obj.replace(1, -100))# 单个值替换单个值
print(ser_obj.replace(range(6,9), -100))# 多个值替换一个值
print(ser_obj.replace([4, 8], [-100, -200]))# 多个值替换多个值

5       0
6    -100
7       2
8       3
9       4
10      5
11      6
12      7
13      8
14      9
dtype: int64
5       0
6       1
7       2
8       3
9       4
10      5
11   -100
12   -100
13   -100
14      9
dtype: int64
5       0
6       1
7       2
8       3
9    -100
10      5
11      6
12      7
13   -200
14      9
dtype: int64

In [12]:
dict = pd.DataFrame({'A' : [0,1,2,3,4,5],
                     'B' : [6,7,8,9,10,11],
                     'C' : ['a','b','c','abc','d','e']})# 生成重复值随机数

In [13]:
dict

   A   B    C
0  0   6    a
1  1   7    b
2  2   8    c
3  3   9  abc
4  4  10    d
5  5  11    e

In [14]:
dict.replace(to_replace = r'^a',value=66,regex=True)# 正则表达式替换

   A   B   C
0  0   6  66
1  1   7   b
2  2   8   c
3  3   9  66
4  4  10   d
5  5  11   e

In [15]:
dict.dtypes# 查看数据类型

A     int64
B     int64
C    object
dtype: object